Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CM-LS_DFP/1.0.88/PIC32CM-LS00/include/pio/pic32cm1216ls00100.h
#define PIN_PB12C_SERCOM3_PAD0                     _UL_(44)    
#define MUX_PB12C_SERCOM3_PAD0                     _UL_(2)     
#define PINMUX_PB12C_SERCOM3_PAD0                  ((PIN_PB12C_SERCOM3_PAD0 << 16) | MUX_PB12C_SERCOM3_PAD0)
#define PORT_PB12C_SERCOM3_PAD0                    (_UL_(1) << 12)

#define PIN_PB20C_SERCOM3_PAD0                     _UL_(52)    
#define MUX_PB20C_SERCOM3_PAD0                     _UL_(2)     
#define PINMUX_PB20C_SERCOM3_PAD0                  ((PIN_PB20C_SERCOM3_PAD0 << 16) | MUX_PB20C_SERCOM3_PAD0)
#define PORT_PB20C_SERCOM3_PAD0                    (_UL_(1) << 20)

#define PIN_PB02C_SERCOM3_PAD0                     _UL_(34)    
#define MUX_PB02C_SERCOM3_PAD0                     _UL_(2)     
#define PINMUX_PB02C_SERCOM3_PAD0                  ((PIN_PB02C_SERCOM3_PAD0 << 16) | MUX_PB02C_SERCOM3_PAD0)
#define PORT_PB02C_SERCOM3_PAD0                    (_UL_(1) << 2)

#define PIN_PB09D_SERCOM3_PAD1                     _UL_(41)    
#define MUX_PB09D_SERCOM3_PAD1                     _UL_(3)     
#define PINMUX_PB09D_SERCOM3_PAD1                  ((PIN_PB09D_SERCOM3_PAD1 << 16) | MUX_PB09D_SERCOM3_PAD1)
#define PORT_PB09D_SERCOM3_PAD1                    (_UL_(1) << 9)

#define PIN_PB13C_SERCOM3_PAD1                     _UL_(45)    
#define MUX_PB13C_SERCOM3_PAD1                     _UL_(2)     
#define PINMUX_PB13C_SERCOM3_PAD1                  ((PIN_PB13C_SERCOM3_PAD1 << 16) | MUX_PB13C_SERCOM3_PAD1)
#define PORT_PB13C_SERCOM3_PAD1                    (_UL_(1) << 13)

#define PIN_PB21C_SERCOM3_PAD1                     _UL_(53)    
#define MUX_PB21C_SERCOM3_PAD1                     _UL_(2)     
#define PINMUX_PB21C_SERCOM3_PAD1                  ((PIN_PB21C_SERCOM3_PAD1 << 16) | MUX_PB21C_SERCOM3_PAD1)
#define PORT_PB21C_SERCOM3_PAD1                    (_UL_(1) << 21)

#define PIN_PB03C_SERCOM3_PAD1                     _UL_(35)    
#define MUX_PB03C_SERCOM3_PAD1                     _UL_(2)     
#define PINMUX_PB03C_SERCOM3_PAD1                  ((PIN_PB03C_SERCOM3_PAD1 << 16) | MUX_PB03C_SERCOM3_PAD1)
#define PORT_PB03C_SERCOM3_PAD1                    (_UL_(1) << 3)

#define PIN_PB18D_SERCOM3_PAD2                     _UL_(50)    
#define MUX_PB18D_SERCOM3_PAD2                     _UL_(3)     
#define PINMUX_PB18D_SERCOM3_PAD2                  ((PIN_PB18D_SERCOM3_PAD2 << 16) | MUX_PB18D_SERCOM3_PAD2)
#define PORT_PB18D_SERCOM3_PAD2                    (_UL_(1) << 18)

#define PIN_PB14C_SERCOM3_PAD2                     _UL_(46)    
#define MUX_PB14C_SERCOM3_PAD2                     _UL_(2)     
#define PINMUX_PB14C_SERCOM3_PAD2                  ((PIN_PB14C_SERCOM3_PAD2 << 16) | MUX_PB14C_SERCOM3_PAD2)
#define PORT_PB14C_SERCOM3_PAD2                    (_UL_(1) << 14)

#define PIN_PA20C_SERCOM3_PAD2                     _UL_(20)    
#define MUX_PA20C_SERCOM3_PAD2                     _UL_(2)     
#define PINMUX_PA20C_SERCOM3_PAD2                  ((PIN_PA20C_SERCOM3_PAD2 << 16) | MUX_PA20C_SERCOM3_PAD2)
#define PORT_PA20C_SERCOM3_PAD2                    (_UL_(1) << 20)

#define PIN_PB00C_SERCOM3_PAD2                     _UL_(32)    
#define MUX_PB00C_SERCOM3_PAD2                     _UL_(2)     
#define PINMUX_PB00C_SERCOM3_PAD2                  ((PIN_PB00C_SERCOM3_PAD2 << 16) | MUX_PB00C_SERCOM3_PAD2)
#define PORT_PB00C_SERCOM3_PAD2                    (_UL_(1) << 0)

#define PIN_PB19D_SERCOM3_PAD3                     _UL_(51)    
#define MUX_PB19D_SERCOM3_PAD3                     _UL_(3)     
#define PINMUX_PB19D_SERCOM3_PAD3                  ((PIN_PB19D_SERCOM3_PAD3 << 16) | MUX_PB19D_SERCOM3_PAD3)
#define PORT_PB19D_SERCOM3_PAD3                    (_UL_(1) << 19)

#define PIN_PB15C_SERCOM3_PAD3                     _UL_(47)    
#define MUX_PB15C_SERCOM3_PAD3                     _UL_(2)     
#define PINMUX_PB15C_SERCOM3_PAD3                  ((PIN_PB15C_SERCOM3_PAD3 << 16) | MUX_PB15C_SERCOM3_PAD3)
#define PORT_PB15C_SERCOM3_PAD3                    (_UL_(1) << 15)

#define PIN_PA21C_SERCOM3_PAD3                     _UL_(21)    
#define MUX_PA21C_SERCOM3_PAD3                     _UL_(2)     
#define PINMUX_PA21C_SERCOM3_PAD3                  ((PIN_PA21C_SERCOM3_PAD3 << 16) | MUX_PA21C_SERCOM3_PAD3)
#define PORT_PA21C_SERCOM3_PAD3                    (_UL_(1) << 21)

#define PIN_PB01C_SERCOM3_PAD3                     _UL_(33)    
#define MUX_PB01C_SERCOM3_PAD3                     _UL_(2)     
#define PINMUX_PB01C_SERCOM3_PAD3                  ((PIN_PB01C_SERCOM3_PAD3 << 16) | MUX_PB01C_SERCOM3_PAD3)
#define PORT_PB01C_SERCOM3_PAD3                    (_UL_(1) << 1)

/* ========== PORT definition for SERCOM4 peripheral ========== */
#define PIN_PA12D_SERCOM4_PAD0                     _UL_(12)    
#define MUX_PA12D_SERCOM4_PAD0                     _UL_(3)     
#define PINMUX_PA12D_SERCOM4_PAD0                  ((PIN_PA12D_SERCOM4_PAD0 << 16) | MUX_PA12D_SERCOM4_PAD0)
#define PORT_PA12D_SERCOM4_PAD0                    (_UL_(1) << 12)

#define PIN_PB24D_SERCOM4_PAD0                     _UL_(56)    
#define MUX_PB24D_SERCOM4_PAD0                     _UL_(3)     
#define PINMUX_PB24D_SERCOM4_PAD0                  ((PIN_PB24D_SERCOM4_PAD0 << 16) | MUX_PB24D_SERCOM4_PAD0)
#define PORT_PB24D_SERCOM4_PAD0                    (_UL_(1) << 24)

#define PIN_PA13D_SERCOM4_PAD1                     _UL_(13)    
#define MUX_PA13D_SERCOM4_PAD1                     _UL_(3)     
#define PINMUX_PA13D_SERCOM4_PAD1                  ((PIN_PA13D_SERCOM4_PAD1 << 16) | MUX_PA13D_SERCOM4_PAD1)
#define PORT_PA13D_SERCOM4_PAD1                    (_UL_(1) << 13)

#define PIN_PB25D_SERCOM4_PAD1                     _UL_(57)    
#define MUX_PB25D_SERCOM4_PAD1                     _UL_(3)     
#define PINMUX_PB25D_SERCOM4_PAD1                  ((PIN_PB25D_SERCOM4_PAD1 << 16) | MUX_PB25D_SERCOM4_PAD1)
#define PORT_PB25D_SERCOM4_PAD1                    (_UL_(1) << 25)

#define PIN_PC24D_SERCOM4_PAD2                     _UL_(88)    
#define MUX_PC24D_SERCOM4_PAD2                     _UL_(3)     
#define PINMUX_PC24D_SERCOM4_PAD2                  ((PIN_PC24D_SERCOM4_PAD2 << 16) | MUX_PC24D_SERCOM4_PAD2)
#define PORT_PC24D_SERCOM4_PAD2                    (_UL_(1) << 24)

#define PIN_PC25D_SERCOM4_PAD3                     _UL_(89)    
#define MUX_PC25D_SERCOM4_PAD3                     _UL_(3)     
#define PINMUX_PC25D_SERCOM4_PAD3                  ((PIN_PC25D_SERCOM4_PAD3 << 16) | MUX_PC25D_SERCOM4_PAD3)
#define PORT_PC25D_SERCOM4_PAD3                    (_UL_(1) << 25)

